//////////////////////////////////////////////////////////////////////////////////////////////////////////
// Механизм блокировки работы с внешними ресурсами:
//  - для поддержания функциональности копий баз
//  - для блокировки взаимодействия копий с продуктовыми внешними системами
//////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Функция ЭтоКопияБазы() Экспорт
	Возврат БлокировкаРаботыСВнешнимиРесурсамиУККлиентСервер.ЭтоКопияБазы();
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
#КонецОбласти