
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КонфигурацияМетеор", КонфигурацияМетеор);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Базы1С.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Базы1С КАК Базы1С
		|ГДЕ
		|	Базы1С.КонфигурацияМетеор = &КонфигурацияМетеор
		|	И Базы1С.КонфигурацияМетеор <> """"
		|	И Базы1С.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон("Обнаружено дублирование поля ""Конфигурация метеор"" %1 с элементом %2",
				КонфигурацияМетеор,
				Выборка.Наименование));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли