//////////////////////////////////////////////////////////////////////////////////////////////////////////
// Механизм блокировки работы с внешними ресурсами:
//  - для поддержания функциональности копий баз
//  - для блокировки взаимодействия копий с продуктовыми внешними системами
//////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Определяет, является ли текущая база копией.
// 
// Возвращаемое значение:
//  Булево - Истина, если текущая база является копией
//
Функция ЭтоКопияБазы() Экспорт
	Возврат БлокировкаРаботыСВнешнимиРесурсамиУКСлужебныйВызовСервера.ЭтоКопияБазы();
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
#КонецОбласти