
#Область ПрограммныйИнтерфейс

Функция НайтиСоздатьМетку(Метка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Справочники.МеткиМетеор.НайтиПоКоду(Метка.Код);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Справочники.МеткиМетеор.СоздатьЭлемент();
	Результат.Код = Метка.Код;
	Результат.Наименование = Метка.Наименование;
	Результат.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
