#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ДействияПослеОбновления

#Область ДобавляемыеОбработчики

Процедура dors_20230615_СтрокиПодключенияSqlConnect(Текст = Неопределено) 
	
	ИмяПредопределенного = "СтрокиПодключенияSqlConnect";
	
	НастройкаСсылка = ПланыВидовХарактеристик.НастройкиПрограммы[ИмяПредопределенного];
	НастройкаОбъект = НастройкаСсылка.ПолучитьОбъект();
	НастройкаОбъект.ИспользуетсяСписокЗначений = Истина;
	НастройкаОбъект.Записать();
	
	МассивЗначений = ВнешниеДанныеВызовСервераПовтИсп.ПолучитьПараметрыПодключенияSqlConnectСовместимость();
	РегистрыСведений.ЗначенияНастроекПрограммы.ЗаписатьЗначениеНастройки(НастройкаСсылка, МассивЗначений);
	
	Текст = "Успешно.";
	
КонецПроцедуры

#КонецОбласти

// Список обработчиков обновления (создания) предопределенных элементов
//
// Параметры:
//  Нет
//
// Возвращаемое значение:
//  Массив, имена процедур
// 
Функция ПолучитьОбработчикиОбновления() Экспорт
	
	ОбработчикиОбновления = Новый Массив;
	ОбработчикиОбновления.Добавить("dors_20230615_СтрокиПодключенияSqlConnect");
	Возврат ОбработчикиОбновления;
	
КонецФункции

Процедура ВыполнитьОбработчикОбновления(ИмяОбработчика, КомментарийОбработчика) Экспорт
	Выполнить СтрШаблон("%1(КомментарийОбработчика)", ИмяОбработчика);
КонецПроцедуры

#КонецОбласти

#КонецЕсли

