
#Область ПрограммныйИнтерфейс

Функция RegExp() Экспорт
	Возврат РегулярныеВыраженияПовтИсп.RegExp();
КонецФункции
	
// Возвращает все подстроки в строке, соответствующие шаблону, в виде массива подстрок
// работает только под Windows
// Параметры:
//  Шаблон 			- Строка - шаблон поиска в виде регулярного выражения
//  СтрокаПоиска 	- Строка - исходная строка
Функция ПолучитьМассивВхождений(Шаблон, СтрокаПоиска) Экспорт
	МассивВхождений = Новый Массив;
	
	RegExp = RegExp();
	RegExp.Pattern = Шаблон;
	Matches = RegExp.Execute(СтрокаПоиска);
	
	ЧислоВхождений = Matches.Count();
	
	Если ЧислоВхождений > 0 Тогда
		Для Индекс = 0 По ЧислоВхождений - 1 Цикл
			Match = Matches.Item(Индекс);
			МассивВхождений.Добавить(Match.Value);
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивВхождений;
КонецФункции

Функция Заменить(ШаблонЗамены, СтрокаЗамены, СтрокаПоиска) Экспорт
	RegExp = RegExp();
	RegExp.Pattern = ШаблонЗамены;
	Возврат RegExp.Replace(СтрокаПоиска, СтрокаЗамены);
КонецФункции

#КонецОбласти