///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Функция GetCurrentState()
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьРезультатЗапроса(ТекстЗапроса, СтруктураПараметров)
	
	ТЗ = ВнешниеДанные.ПолучитьРезультатЗапроса(ТекстЗапроса, СтруктураПараметров);
	Возврат XMLСтрока(Новый ХранилищеЗначения(ТЗ));
	
КонецФункции

Функция ЗарегистрироватьОбновлениеИБ(Хранилище, НомерКоммита, База1С, Комментарий, Ответственный)
	
	Возврат РегистрыСведений.ИсторияПримененияКонфигураций.ЗарегистрироватьОбновлениеИБ(Хранилище, НомерКоммита, База1С, Комментарий, Ответственный);
	
КонецФункции

Функция ПолучитьСписокПредопределенныхЭлементов(КонфигурацияИдентификатор)
	
	СтруктураПараметров = Новый Структура("КонфигурацияИдентификатор", КонфигурацияИдентификатор);
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Спр.Владелец.Наименование КАК ОбъектМетаданных,
		|	Спр.УИД КАК УИД,
		|	Спр.Наименование КАК ИмяПредопределенного,
		|	Спр.Синоним КАК Синоним,
		|	Спр.КодЭлемента КАК Код,
		|	Спр.ЯвляетсяГруппой КАК ЭтоГруппа,
		|	Спр.Группа.УИД КАК РодительУИД
		|ИЗ
		|	Справочник.ПредопределенныеЭлементыОбъектовМетаданных КАК Спр
		|ГДЕ
		|	Спр.Владелец.Владелец.Идентификатор = &КонфигурацияИдентификатор
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОбъектМетаданных,
		|	ЭтоГруппа УБЫВ,
		|	Код";
	Возврат ПолучитьРезультатЗапроса(ТекстЗапроса, СтруктураПараметров);
	
КонецФункции

#КонецОбласти