
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Выбранные.Загрузить(Параметры.Конфигурации.Выгрузить(,"Конфигурация"));
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)

	Закрыть(Выбранные);
КонецПроцедуры


&НаКлиенте
Процедура Добавить(Команда)
	
	ВыбраннаяКонфигурация = Элементы.Список.ТекущаяСтрока;
	Если  Выбранные.НайтиСтроки(Новый Структура("Конфигурация",ВыбраннаяКонфигурация)).Количество() = 0 Тогда
		Нов = Выбранные.Добавить();
		Нов.Конфигурация = ВыбраннаяКонфигурация;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	
	ТС = Элементы.Выбранные.ТекущиеДанные;
	Выбранные.Удалить(ТС);
	
КонецПроцедуры


&НаКлиенте
Процедура УдалитьВсе(Команда)
	
	Выбранные.Очистить();
	
КонецПроцедуры


