#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура Отразить(Коммит, ПройденныеТесты) Экспорт
	
	НачатьТранзакцию();
	
	Для Каждого Строка Из ПройденныеТесты Цикл
		мз = РегистрыСведений.ПройденныеТесты.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(мз, Строка);
		мз.Коммит = Коммит;
		мз.ТестПройден = мз.стрСтатус = "success";
		мз.Записать();
	КонецЦикла;
	
	РегистрыСведений.СломанныеТесты.Отразить(Коммит);
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
