
#Область СлужебныйПрограммныйИнтерфейс

// Функция - Получить HTTPСоединение
//
// Параметры:
//  ИмяВебСервера	 - Строка	 - Имя или IP адрес
//  Порт			 - Число	 - По умолчанию 80
// 
// Возвращаемое значение:
//   - HTTPСоединение
//
Функция ПолучитьHTTPСоединение(ИмяВебСервера, Порт = 80, Таймаут = 0) Экспорт 
	Возврат Новый HTTPСоединение(ИмяВебСервера, Порт, , , , Таймаут);
КонецФункции

// Функция - Получить параметры подключения sql connect
// 
// Возвращаемое значение:
//   - Массив строк
//
Функция ПолучитьПараметрыПодключенияSqlConnect() Экспорт
	
	Настройка = ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиПрограммы.СтрокиПодключенияSqlConnect");
	ПараметрыПодключения = РегистрыСведений.ЗначенияНастроекПрограммы.ПолучитьЗначениеНастройки(Настройка, Новый Массив, Истина);
	Если ПараметрыПодключения.Количество() = 0 Тогда
		ПараметрыПодключения = ПолучитьПараметрыПодключенияSqlConnectСовместимость();
	КонецЕсли;
	Возврат ПараметрыПодключения;
	
КонецФункции

// Функция - Получить параметры подключения sql connect совместимость
// 
// Возвращаемое значение:
//   - Массив строк
//
Функция ПолучитьПараметрыПодключенияSqlConnectСовместимость() Экспорт
	
	ПараметрыПодключения = Новый Массив;
	Если БлокировкаРаботыСВнешнимиРесурсамиУКСлужебныйВызовСервера.ЭтоКопияБазы() = Ложь Тогда
		ПараметрыПодключения.Добавить("izb-app21:sql_connect/hs/SQLConnect/");
		ПараметрыПодключения.Добавить("izb-app18:sql_connect_r/hs/SQLСonnect/");
	Иначе
		// Это копия базы, переключение на тестовый контур
		ПараметрыПодключения.Добавить("izb-dev03:sql_connect_test01/hs/SQLСonnect/");
	КонецЕсли;
	Возврат ПараметрыПодключения;
	
	
КонецФункции

#КонецОбласти
