
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если Не ЗначениеЗаполнено(Запись.ЛогическаяПодсистема) Тогда
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю("Не заполнено поле ""Логическая подсистема"".");
			Возврат;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли