Функция ВерсияХранилищаПоХэшу(Хэш) Экспорт

	Результат = Справочники.ИсторияХранилища.ПустаяСсылка();
	
	Если ТипЗнч(Хэш) <> Тип("Строка")
		Или Не ЗначениеЗаполнено(Хэш)
		Или СтрДлина(Хэш) <> 40 Тогда
	
		ВызватьИсключение "Ожидается хэш - строка длиной 40 символов";
	
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Хэш", Хэш);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВерсияХранилища
	|ИЗ
	|	РегистрСведений.ХешиGitВерсийХранилища
	|ГДЕ
	|	Хеш = &Хэш";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
	
		Результат = Выборка.ВерсияХранилища;
	
	КонецЕсли;
	
	Возврат Результат;

КонецФункции
