
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьКонфигурациюПодсистемы();
	УправлениеФормой(ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КонфигурацияПриИзменении(Элемент)
	УправлениеФормой(ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	Форма.Элементы.Подсистема.Доступность = ЗначениеЗаполнено(Форма.Конфигурация);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонфигурациюПодсистемы()
	Конфигурация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.Подсистема, "Владелец");
КонецПроцедуры

#КонецОбласти