
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Наименование");
	Поля.Добавить("Ссылка");
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РуководителиКомандСрезПоследних.Руководитель.Наименование КАК РуководительНаименование
		|ИЗ
		|	РегистрСведений.РуководителиКоманд.СрезПоследних КАК РуководителиКомандСрезПоследних
		|ГДЕ
		|	РуководителиКомандСрезПоследних.Команда = &Команда";
	Запрос.УстановитьПараметр("Команда", Данные.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	РуководительКоманды = "";
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		РуководительКоманды = Выборка.РуководительНаименование;
	КонецЕсли;
	Представление = СтрШаблон("%1 (%2)", Данные.Наименование, РуководительКоманды);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
