
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	УстановитьМеткуПоУмолчаниюНаСервере(ПараметрКоманды);
	ОповеститьОбИзменении(Тип("СправочникСсылка.ИсторияХранилища"));
	
КонецПроцедуры

&НаСервере
Процедура УстановитьМеткуПоУмолчаниюНаСервере(ВерсиХранилища)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого Версия Из ВерсиХранилища Цикл
		
		ВерсияОбъект = Версия.ПолучитьОбъект();
		Если ЗначениеЗаполнено(ВерсияОбъект.Метка) Тогда
			Продолжить;
		КонецЕсли;
		
		ВерсияОбъект.Метка = "<Метка по умолчанию>";
		ВерсияОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры
