
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьСсылкиЗадачМетеор();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЗаполнитьСсылкиЗадачМетеор();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ЗаполнитьСсылкиЗадачМетеор();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Задачи

&НаКлиенте
Процедура ЗадачиЗадачаМетеорПриИзменении(Элемент)
	ТекДанные = Элементы.Задачи.ТекущиеДанные;
    ТекДанные.СсылкаЗадачиМетеор = ПолучитьСсылкуЗадачиМетеор(ТекДанные.ЗадачаМетеор);
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле = Элементы.ЗадачиСсылкаЗадачиМетеор Тогда
		СтандартнаяОбработка = Ложь;
		ПерейтиПоНавигационнойСсылке(Элемент.ТекущиеДанные.СсылкаЗадачиМетеор);
		//НачатьЗапускПриложения(Новый ОписаниеОповещения, Элемент.ТекущиеДанные.URLGit);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСсылкиЗадачМетеор()
	Для Каждого СтрокаЗадачи Из Объект.Задачи Цикл
		СтрокаЗадачи.СсылкаЗадачиМетеор = ПолучитьСсылкуЗадачиМетеор(СтрокаЗадачи.ЗадачаМетеор);
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСсылкуЗадачиМетеор(ЗадачаМетеор)
	Возврат Справочники.ЗадачиМетеор.URLЗадачиМетеор(ЗадачаМетеор);
КонецФункции


#КонецОбласти