
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СписокКонфигураций") Тогда
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
    	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
    	ЭлементОтбора.Использование = Истина;
    	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
    	ЭлементОтбора.ПравоеЗначение = Параметры.СписокКонфигураций;
		
	КонецЕсли;
КонецПроцедуры
