#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
    
    ЮТТесты
        .ДобавитьТест("СообщениеОбИзмененииПриСогласовании")
    ;

КонецПроцедуры

Процедура СообщениеОбИзмененииПриСогласовании() Экспорт

//	   + Справочник.ИсторияХранилища
//	+...Изменены
//	+  БизнесПроцесс.ПредварительнаяПроверка
//	++Комиты
//	
//	РегистрСведений.СоставЛогическихПодсистем
//	Справочник.ОбъектыМетаданных
//	Справочник.Пользователи
//	- ОТветвенный по подспистем
//	- Проверяющий

	БП_ПредварительнаяПроверка = ЮТест.Данные().СоздатьЭлемент(БизнесПроцессы.ПредварительнаяПроверка);
    
    ЮТест.ОжидаетЧто(БП_ПредварительнаяПроверка.ЮТ_ПолучитьСообщенияКОтправкеДляТеста())
        .ИмеетТип("Массив")
        .Заполнено()
       ;

КонецПроцедуры

#КонецОбласти