
Процедура ПриЗаписи(Отказ, Замещение)
	Для Каждого Запись Из ЭтотОбъект Цикл
		Период = '00010101' + Запись.ДатаЗаписиУниверсальная / 1000;
		СлужебныйНабор = РегистрыСведений.СтатусыВерсийХранилищаСлужебный.СоздатьНаборЗаписей();
		СлужебныйНабор.Отбор.ВерсияХранилища.Установить(Запись.ВерсияХранилища);
		СлужебныйНабор.Отбор.Период.Установить(Период);
		СлужебнаяСтрока = СлужебныйНабор.Добавить();
		ЗаполнитьЗначенияСвойств(СлужебнаяСтрока, Запись);
		СлужебнаяСтрока.Период = Период;
		СлужебныйНабор.Записать();
	КонецЦикла;
	Если ЭтотОбъект.Количество() = 0 И Отбор.ДатаЗаписиУниверсальная.Использование И Отбор.ВерсияХранилища.Использование Тогда
		Период = '00010101' + Отбор.ДатаЗаписиУниверсальная.Значение / 1000;
		СлужебныйНабор = РегистрыСведений.СтатусыВерсийХранилищаСлужебный.СоздатьНаборЗаписей();
		СлужебныйНабор.Отбор.ВерсияХранилища.Установить(Отбор.ВерсияХранилища.Значение);
		СлужебныйНабор.Отбор.Период.Установить(Период);
		СлужебныйНабор.Записать();
	КонецЕсли;
КонецПроцедуры
