//////////////////////////////////////////////////////////////////////////////////////////////////////////
// Методы работы с регламентными заданиями
//////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// См. РегламентныеЗаданияПереопределяемый.ПриОпределенииНастроекРегламентныхЗаданий
Процедура ПриОпределенииНастроекРегламентныхЗаданий(Настройки) Экспорт
	
	// Оставил как образец
	// ЗагрузкаНовыхКоммитовGIT
	//Настройка = Настройки.Добавить();
	//Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.ЗагрузкаНовыхКоммитовGIT;
	//Настройка.РаботаетСВнешнимиРесурсами = Истина;
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти