
#Область ПрограммныйИнтерфейс

Процедура ОбновитьДанныеИзМетеора() Экспорт
	
	ДанныеМетеор = ИнтеграцияСМетеор.ПолучитьДанныеЗадачиИзМетеор(ЭтотОбъект);
	Если ДанныеМетеор = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеМетеор,,"Метки");
	
	Метки.Очистить();
	Для Каждого Метка Из ДанныеМетеор.Метки Цикл
		НовСтр = Метки.Добавить();
		НовСтр.Метка = Справочники.МеткиМетеор.НайтиСоздатьМетку(Метка);
		НовСтр.Комментарий = Метка.Комментарий;
	КонецЦикла;
	Срочная = Метки.Найти(Справочники.МеткиМетеор.Срочное,"Метка") <> Неопределено;
	
КонецПроцедуры 

#КонецОбласти
