#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Настройка = ПланыВидовХарактеристик.НастройкиПрограммы.ОтметкаВремениЗагрузкиЭтаповМетеор;
	Объект.НачалоПериода = РегистрыСведений.ЗначенияНастроекПрограммы.ПолучитьЗначениеНастройки(Настройка);
	Объект.КонецПериода = ТекущаяДатаСеанса();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Регламент(Команда)
	РегламентНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьНаСервере()
	ДанныхЗаписано = РаботаСДаннымиМетеор.ЗагрузкаИсторииЭтаповЗадачМетеорЗаПериод(Объект.НачалоПериода, Объект.КонецПериода);
	Сообщить(ДанныхЗаписано);
КонецПроцедуры

&НаСервере
Процедура РегламентНаСервере()
	РаботаСДаннымиМетеор.ЗагрузкаИсторииЭтаповЗадачМетеорОбработчикЗадания();
КонецПроцедуры

#КонецОбласти



