Процедура ОчисткаУстаревшихДанных(СколькоДнейОставить = 60) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Рег.Дата КАК Дата
		|ИЗ
		|	РегистрСведений.СтатистикаМониторинга КАК Рег
		|ГДЕ
		|	Рег.Дата < &Дата
		|
		|УПОРЯДОЧИТЬ ПО
		|	Рег.Дата";
	Запрос.УстановитьПараметр("Дата", НачалоДня(ТекущаяДата() - СколькоДнейОставить * 24 * 3600));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Ластик = РегистрыСведений.СтатистикаМониторинга.СоздатьНаборЗаписей();
		Ластик.Отбор.Дата.Установить(Выборка.Дата);
		Ластик.Записать();
	КонецЦикла;
КонецПроцедуры
