
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Текст = СформироватьHtmlОписание(ПараметрКоманды);
	ПараметрыФормы = Новый Структура("html", Текст);
	ОткрытьФорму("ОбщаяФорма.ФормаHTML", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

&НаСервере
Функция СформироватьHtmlОписание(ПараметрКоманды)
	
	Возврат Документы.ТехническийПроект.СформироватьHtmlОписание(ПараметрКоманды);
	
КонецФункции