
#Область ПрограммныйИнтерфейс

Процедура СоздатьПисьмо(Данные) Экспорт 
	
	Док = Документы.ЭлектронноеПисьмо.СоздатьДокумент();
	
	Док.Дата = ТекущаяДатаСеанса();
	Данные.Свойство("Получатели", Док.Получатели);
	Данные.Свойство("Тема", Док.Тема);
	Данные.Свойство("Тело", Док.Тело);
	
	Если Данные.Свойство("Вложения") Тогда
		Для Каждого Вложение Из Данные.Вложения Цикл
			НовСтр = Док.Вложения.Добавить();
			НовСтр.Ключ = Вложение.Ключ;
			НовСтр.Расширение = Вложение.Расширение;
			НовСтр.Значение = Новый ХранилищеЗначения(Вложение.Значение);
		КонецЦикла;	
	КонецЕсли;
	
	Док.Записать(РежимЗаписиДокумента.Запись);
		
КонецПроцедуры

#КонецОбласти
