
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Использование одной формы для списка и выбора
	Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
	Если Параметры.МножественныйВыбор <> Неопределено Тогда
		Элементы.Список.МножественныйВыбор = Параметры.МножественныйВыбор;
	КонецЕсли;
	// обход автоматического сохранения пользовательских настроек для разных режимов
	Если Параметры.РежимВыбора И Не ЗначениеЗаполнено(Параметры.КлючПользовательскихНастроек) Тогда
		Параметры.КлючПользовательскихНастроек = "РежимВыбора";
		Список.АвтоматическоеСохранениеПользовательскихНастроек = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Дополнения
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьВерсию(Команда)
	ОткрытьФорму(
		"Справочник.ВерсииДополнений.ФормаОбъекта",
		Новый Структура("ПоказатьДиалогЗагрузкиИзФайлаПриОткрытии", Истина),
		ЭтаФорма,
		УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьГерераторИмениРасширения(Команда)
	ОткрытьФорму("Справочник.ВерсииДополнений.Форма.ФормаГенератораИмениВерсииРасширения");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
#КонецОбласти

