
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСписокОбъетовСКодом();
	
	Если Не ЗначениеЗаполнено(Запись.Дата) Тогда
		Запись.Дата = ТекущаяДата();
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Запись.Автор) Тогда
		Запись.Автор = Пользователи.ТекущийПользователь();
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписокОбъетовСКодом()

	СписокВыбора = Элементы.ИмяОбъекта.СписокВыбора;
	СписокВыбора.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Коммит", Запись.Коммит);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Файл КАК ИмяОбъекта
	|ИЗ
	|	Справочник.ИсторияХранилища.ФайлыGit
	|ГДЕ
	|	Файл ПОДОБНО ""%.bsl""
	|	И Ссылка = &Коммит";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		СписокВыбора.Добавить(Выборка.ИмяОбъекта);
	
	КонецЦикла; 

КонецПроцедуры

#КонецОбласти
