//////////////////////////////////////////////////////////////////////////////////////////////////////////
// Механизм блокировки работы с внешними ресурсами:
//  - для поддержания функциональности копий баз
//  - для блокировки взаимодействия копий с продуктовыми внешними системами
//////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Определяет, является ли текущая база копией.
// 
// Возвращаемое значение:
//  Булево - Истина, если текущая база является копией
//
Функция ЭтоКопияБазы() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Возврат (Найти(НРег(СтрокаСоединенияИнформационнойБазы()), """repos""") = 0)
		И Не ПараметрыСеанса.ВыполняетсяОтладкаВКопии;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти