#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// FIXME: данная функция вызывается в рег.задании.
// 1. По-хорошему функцию нужно перенести в общий модуль
// 2. при этом появится возможность вообще необходимости проверки. Возможно, добавить список проверяемых б.п.
Функция ЗадачаВыполнима(Задача, ТочкаМаршрута) Экспорт
	
	ЗадачаВыполнима = Истина;
	
	Возврат ЗадачаВыполнима;
	
КонецФункции

// FIXME: данная функция вызывается в рег.задании. При этом, если в б.п. такой функции нет, падает с ошибкой.
// 1. По-хорошему функцию нужно перенести в общий модуль
// 2. при этом появится возможность вообще необходимости проверки. Возможно, добавить список проверяемых б.п.
Функция МожноАвтозавершитьЗадачу(Задача, ТочкаМаршрута) Экспорт
	
	Возврат Ложь;
	
КонецФункции

// FIXME: данная функция вызывается при получении события метеор.
Функция АктивныйПроцесс(ЗадачаМетеор, ПроцессИсключения = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОтключениеРасширения.Ссылка КАК Ссылка
	|ИЗ
	|	БизнесПроцесс.ОтключениеРасширения КАК ОтключениеРасширения
	|ГДЕ
	|	ОтключениеРасширения.Стартован
	|	И НЕ ОтключениеРасширения.Завершен
	|	И НЕ ОтключениеРасширения.ПометкаУдаления
	|	И ОтключениеРасширения.ЗадачаМетеор = &ЗадачаМетеор";
	Запрос.УстановитьПараметр("ЗадачаМетеор", ЗадачаМетеор);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		АктивныйПроцесс = Выборка.Ссылка;
	Иначе
		АктивныйПроцесс = БизнесПроцессы.ОтключениеРасширения.ПустаяСсылка();
	КонецЕсли;
	Возврат АктивныйПроцесс;
	
КонецФункции

// FIXME: данная функция вызывается в рег.задании.
// 1. По-хорошему функцию нужно перенести в общий модуль
// 2. при этом появится возможность вообще необходимости проверки. Возможно, добавить список проверяемых б.п.
Процедура ПриАвтозавершении(Задача, ТочкаМаршрута) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
