
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает следующие этапы для точки маршрута
//
// Параметры:
//  ТочкаМаршрута	 - ТочкаМаршрутаБизнесПроцесса - Точка маршрута, для которой будут получены этапы
//  Согласовано		 - Булево - Статус согалсования
// 
// Возвращаемое значение:
//  Массив - Массив этапов задачи метеор
//
Функция ПолучитьЭтапыПоТочкеМаршрута(ТочкаМаршрута, Согласовано) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СледующиеЭтапыЗадачиПоТочкеМаршрута.Этап КАК Этап
		|ИЗ
		|	РегистрСведений.СледующиеЭтапыЗадачиПоТочкеМаршрута КАК СледующиеЭтапыЗадачиПоТочкеМаршрута
		|ГДЕ
		|	СледующиеЭтапыЗадачиПоТочкеМаршрута.ТочкаМаршрута = &ТочкаМаршрута
		|	И СледующиеЭтапыЗадачиПоТочкеМаршрута.Согласовано = &Согласовано";
	
	Запрос.УстановитьПараметр("Согласовано", Согласовано);
	Запрос.УстановитьПараметр("ТочкаМаршрута", ТочкаМаршрута);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Этап");
	
КонецФункции


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
