
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Тест(Команда)
	ТестНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ТестНаСервере()
	Данные = СтроковыеФункцииУККлиентСервер.ПрочитатьЗначениеJSON(Запись.Данные);
	Попытка
		Ответ = РегистрыСведений.СобытияМетеор.ОбработатьДействие(Данные);
		Сообщить(СтроковыеФункцииУККлиентСервер.ЗаписатьЗначениеJSON(Ответ));
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

#КонецОбласти
