
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВыполняетсяОтладкаВКопии = ПараметрыСеанса.ВыполняетсяОтладкаВКопии;
	НастроитьФорму(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВыполняетсяОтладкаВКопииПриИзменении(Элемент)
	ВыполняетсяОтладкаВКопииПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_
#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьФорму(Форма)

КонецПроцедуры

&НаСервере
Процедура ВыполняетсяОтладкаВКопииПриИзмененииНаСервере()
	ПараметрыСеанса.ВыполняетсяОтладкаВКопии = ВыполняетсяОтладкаВКопии;
	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры

#КонецОбласти