&НаСервере
Процедура ОтправитьПисьмоНаСервере()
	ОбъектДокумент = РеквизитФормыВЗначение("Объект");
	ОбъектДокумент.ОтправитьПисьмо();
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПисьмо(Команда)
	ОтправитьПисьмоНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьВложениеНаСервере(Ключ)
	Об = РеквизитФормыВЗначение("Объект");
	ТекущиеДанные = Об.Вложения.НайтиСтроки(Новый Структура("Ключ", Ключ))[0];
	Возврат ПоместитьВоВременноеХранилище(ТекущиеДанные.Значение.Получить());
КонецФункции

&НаКлиенте
Процедура ОткрытьВложение(Команда)
	ТекущиеДанные = Элементы.Вложения1.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Адрес = ПолучитьВложениеНаСервере(ТекущиеДанные.Ключ);
	Данные = ПолучитьИзВременногоХранилища(Адрес);
	#Если ВебКлиент Тогда
		ВременныйФайл = СтрШаблон("%1%2.%3", КаталогВременныхФайлов(), ТекущиеДанные.Ключ, ТекущиеДанные.Расширение);
	#Иначе
		ВременныйФайл = ПолучитьИмяВременногоФайла(ТекущиеДанные.Расширение);
	#КонецЕсли
	Данные.Записать(ВременныйФайл);
	НачатьЗапускПриложения(Новый ОписаниеОповещения, ВременныйФайл);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Вложения = Новый Структура;
	Для Каждого Стр Из ТекущийОбъект.Вложения Цикл
		Вложения.Вставить(Стр.Ключ, Стр.Значение.Получить());
	КонецЦикла;
	ФорматированныйДокумент.УстановитьHTML(ТекущийОбъект.Тело, Вложения);
КонецПроцедуры

