
//////////////////////////////////////////////////////////////////////////////////////////////////////////
// Форма задачи исполнителя для бизнес процесса КонтрольТрудозатрат
//  
//////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Объект.Ссылка.Пустая() Тогда
		ЗадачаМетеор = Задачи.ЗадачаИсполнителя.ЗадачаМетеор(Объект.Ссылка);
		РольИсполнителяЗадачи = 
			?(Объект.РольИсполнителя = Справочники.РолиИсполнителей.ЭкспертОценкиТрудозатратРазработки,
				Справочники.РолиИсполнителей.Разработчик,
				Справочники.РолиИсполнителей.Аналитик);
				
		Элементы.ОценкаЧасов.АктивизироватьПоУмолчанию = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выполнена(Команда)

	ОчиститьСообщения();
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыполненаНаСервере() Тогда
		
		
		ПоказатьОповещениеПользователя(
			"Выполнение:",
			ПолучитьНавигационнуюСсылку(Объект.Ссылка),
			Строка(Объект.Ссылка),
			БиблиотекаКартинок.Информация32);
		
		ОповеститьОбИзменении(Объект.Ссылка);
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВыполненаНаСервере()
	
	НачатьТранзакцию();
	
	// Запись оценки необходимо выполнять до "выполнения" задачи,
	// т.к. переход по карте маршрута идёт в транзакции после выполнения, но до события "ПриЗаписиНаСервере"
	Менеджер = РегистрыСведений.ОценкаТрудозатратПоЗадачам.СоздатьМенеджерЗаписи();
	Менеджер.ЗадачаМетеор = ЗадачаМетеор;
	Менеджер.РольИсполнителяЗадачи = РольИсполнителяЗадачи;
	Менеджер.Количество = ОценкаЧасов;
	Менеджер.Ответственный = Пользователи.ТекущийПользователь();
	Менеджер.Дата = ТекущаяДатаСеанса();
	Менеджер.Записать();
	
	Выполнена = Записать(Новый Структура("ВыполнитьЗадачу", Истина));
	
	ЗафиксироватьТранзакцию();
	
	Возврат Выполнена;
	
КонецФункции


#КонецОбласти
