#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// FIXME: данная функция вызывается в рег.задании. При этом, если в б.п. такой функции нет, падает с ошибкой.
// 1. По-хорошему функцию нужно перенести в общий модуль
// 2. при этом появится возможность вообще необходимости проверки. Возможно, добавить список проверяемых б.п.
Функция МожноАвтозавершитьЗадачу(Задача, ТочкаМаршрута) Экспорт
	
	Возврат Ложь;
	
КонецФункции


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
