
Функция МетодыОбработкаЗапросов(Запрос)
	
	РегистрыСведений.СобытияМетеор.СоздатьЗапись("HTTP", Запрос.ПолучитьТелоКакСтроку());
	
	Данные = СтроковыеФункцииУККлиентСервер.ПрочитатьЗначениеJSON(Запрос.ПолучитьТелоКакСтроку());
	
	Если ТипЗнч(Данные) = Тип("Структура")
		И Не Данные.Свойство("method") Тогда
	
		РегистрыСведений.СобытияМетеор.СоздатьЗапись("HTTP_sql", Запрос.ПолучитьТелоКакСтроку());
		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.УстановитьТелоИзСтроки("Ok");
		Возврат Ответ;
	
	КонецЕсли; 
	
	Попытка
		
		Ответ = Новый HTTPСервисОтвет(200);
		ДанныеОтвета = РегистрыСведений.СобытияМетеор.ОбработатьДействие(Данные);
		Ответ.УстановитьТелоИзСтроки(СтроковыеФункцииУККлиентСервер.ЗаписатьЗначениеJSON(ДанныеОтвета));
		Возврат Ответ;
		
	Исключение
		ТекстОшибки = СтрШаблон(
		"При выполнении запроса к сервису Repos возникла ошибка:
		|%1",
		ОписаниеОшибки());
		ЗаписьЖурналаРегистрации("HTTPСервис_Repos",
			УровеньЖурналаРегистрации.Предупреждение,
			Метаданные.HTTPСервисы.Repos,
			,
			ТекстОшибки);
		Ответ = Новый HTTPСервисОтвет(500);
		Ответ.Заголовки.Вставить("Content-Type", "text/html; charset=utf-8");
		Ответ.УстановитьТелоИзСтроки(ТекстОшибки);
		Возврат Ответ;
		
	КонецПопытки;
	
КонецФункции
