#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ГруппаОтладка.Видимость = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаСервере
Процедура ЗапуститьОбработчикЗадачиНаСервере()
	БП = Объект.БизнесПроцесс;
	Если БП.Завершен Тогда
		об = БП.ПолучитьОбъект();
		об.Завершен = Ложь;
		об.Записать();
	КонецЕсли;
	
	об = РеквизитФормыВЗначение("Объект");
	Если об.Выполнена Тогда
		об.Выполнена = Ложь;
		об.Записать();
	КонецЕсли;
	
	Если БизнесПроцессы[Объект.БизнесПроцесс.Метаданные().Имя].ЗадачаВыполнима(Объект.Ссылка, Объект.ТочкаМаршрута) Тогда 
		об.ВыполнитьЗадачу();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьОбработчикЗадачи(Команда)
	ЗапуститьОбработчикЗадачиНаСервере();
	Прочитать();
	ОповеститьОбИзменении(Объект.БизнесПроцесс);
	Оповестить("ЗаписьЗадачи", Объект.БизнесПроцесс, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ДоступностьОтладки(Команда)
	Элементы.ГруппаОтладка.Видимость = Истина;
КонецПроцедуры

&НаСервере
Процедура СброситьСчетчикНаСервере()
	РеквизитФормыВЗначение("Объект").Заблокировать();
	Объект.КоличествоПопыток = 0;
	Объект.Заблокирована = Ложь;
	Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
		Объект.Наименование = Объект.Комментарий;
	КонецЕсли;
	Записать();
	РеквизитФормыВЗначение("Объект").Разблокировать();
КонецПроцедуры

&НаКлиенте
Процедура СброситьСчетчик(Команда)
	СброситьСчетчикНаСервере();
	Прочитать();
КонецПроцедуры

#КонецОбласти
